KCX-Mapping-Convert/testdaten/EMCS-V20/kaUidsChgDest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<soap:Header>
<Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true">
<To>DE01.CSFALT.2144</To>
<From>DE.CSF</From>
<MessageID>DE01DE01214420100510120200000001</MessageID>
<SentAt>2011-08-19 12:02:00 +0200</SentAt>
<Act>request</Act>
<Method>EMCS</Method>
<MessageVersion>2.0</MessageVersion>
<MessageType>EMCSChgOfDestinationInfo</MessageType>
</Header>
</soap:Header>
<soap:Body>
<Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911">
<EMCS>
<EMCSChgOfDestinationInfo>
<LocalReferenceNumber>ReferenceNumber</LocalReferenceNumber>
<UpdateEaad>
<AadReferenceCode>AadReferenceCode</AadReferenceCode>
<JourneyTime>123400</JourneyTime>
<ChangedTransportArrangement>ChangedTransportArrangement</ChangedTransportArrangement>
<SequenceNumber>1</SequenceNumber>
<InvoiceDate>1967-08-13</InvoiceDate>
<InvoiceNumber>InvoiceNumber</InvoiceNumber>
<TransportModeCode>TransportModeCode</TransportModeCode>
</UpdateEaad>
<DateAndTimeOfValidation>2010-04-14T12:12:00+0200</DateAndTimeOfValidation>
<NewTransportArrangerTrader>
<CustomerID>CustomerID-TA</CustomerID>
<VATID>VATID-TA</VATID>
<Address>
<Name>Name-TA</Name>
<Street>StreetAndNumber-TA</Street>
<HouseNumber>1ta</HouseNumber>
<PostalCode>PostalCode-TA</PostalCode>
<City>City-TA</City>
<Language>TA</Language>
</Address>
</NewTransportArrangerTrader>
<NewTransporterTrader>
<CustomerID>CustomerID-FT</CustomerID>
<VATID>VATID-FT</VATID>
<Address>
<Name>Name-FT</Name>
<Street>StreetAndNumber-FT</Street>
<HouseNumber>1ft</HouseNumber>
<PostalCode>PostalCode-FT</PostalCode>
<City>City-FT</City>
<Language>FT</Language>
</Address>
</NewTransporterTrader>
<ChangedDestination>
<DestinationTypeCode>DestinationTypeCode</DestinationTypeCode>
<NewConsigneeTrader>
<CustomerID>CustomerID-TA</CustomerID>
<VATID>VATID-TA</VATID>
<Address>
<Name>Name-TA</Name>
<Street>StreetAndNumber-TA</Street>
<HouseNumber>1ta</HouseNumber>
<PostalCode>PostalCode-TA</PostalCode>
<City>City-TA</City>
<Language>TA</Language>
</Address>
</NewConsigneeTrader>
<DeliveryPlaceTrader>
<CustomerID>CustomerID-FT</CustomerID>
<VATID>VATID-FT</VATID>
<Address>
<Name>Name-FT</Name>
<Street>StreetAndNumber-FT</Street>
<HouseNumber>1ft</HouseNumber>
<PostalCode>PostalCode-FT</PostalCode>
<City>City-FT</City>
<Language>FT</Language>
</Address>
</DeliveryPlaceTrader>
<DeliveryPlaceCustomsOffice>DeliveryPlaceCustomsOffice</DeliveryPlaceCustomsOffice>
</ChangedDestination>
<TransportDetails>
<TransportUnitCode>1</TransportUnitCode>
<IdentityOfTransportUnits>IdentityOfTransportUnits</IdentityOfTransportUnits>
<CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification>
<ComplementaryInformation language="AA">ComplementaryInformation</ComplementaryInformation>
<SealInformation language="AA">SealInformation</SealInformation>
</TransportDetails>
<TransportDetails>
<TransportUnitCode>2</TransportUnitCode>
<IdentityOfTransportUnits>IdentityOfTransportUnits</IdentityOfTransportUnits>
<CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification>
<ComplementaryInformation language="AA">ComplementaryInformation</ComplementaryInformation>
<SealInformation language="AA">SealInformation</SealInformation>
</TransportDetails>
</EMCSChgOfDestinationInfo>
</EMCS>
</Submit>
</soap:Body>
</soap:Envelope>
